app/controllers/reservations_controller.rb

SELECT "reservations".* FROM "reservations" ORDER BY price DESC
---
  def index
    @reservations = Reservation.all

INSERT INTO "reservations" ("resnum", "deliverydate", "price", "comment", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save